In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df = pd.read_csv('data/bengaluru_house_prices.csv')
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [6]:
df2 = df.drop(['area_type', 'availability', 'society', 'balcony'], axis='columns')
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [7]:
df2.isnull().sum()/df2.shape[0]

location      0.000075
size          0.001201
total_sqft    0.000000
bath          0.005480
price         0.000000
dtype: float64

# Data Cleaning

In [12]:
df3 = df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [13]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

On remarque que 2 BHK et 2 bedroom sont considérés distincts/ differents alors qu'ils ont la meme signification.
on va donc garder le numéro et supprimer la suite.

In [22]:
df3['bhk'] = df3['size'].apply(lambda x: int(x.split()[0]))
df3.head()

C:\Users\pc\AppData\Local\Temp\ipykernel_24636\3244835811.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk'] = df3['size'].apply(lambda x: int(x.split()[0]))

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [23]:
df3['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [26]:
df3[df3['bhk']>=7]

                    location       size total_sqft  bath  price  bhk
45                HSR Layout  8 Bedroom        600   9.0  200.0    8
64              Bommanahalli  8 Bedroom       3000   8.0  140.0    8
68       Devarachikkanahalli  8 Bedroom       1350   7.0   85.0    8
129       Vishwapriya Layout  7 Bedroom        950   7.0  115.0    7
140              Hennur Road  8 Bedroom       5000   8.0  250.0    8
...                      ...        ...        ...   ...    ...  ...
13219                Laggere  7 Bedroom       1590   9.0  132.0    7
13221          T Dasarahalli  9 Bedroom       1178   9.0   75.0    9
13226  Raja Rajeshwari Nagar  8 Bedroom       6000   8.0  215.0    8
13277    Kundalahalli Colony  7 Bedroom       1400   7.0  218.0    7
13311       Ramamurthy Nagar  7 Bedroom       1500   9.0  250.0    7

[269 rows x 6 columns]